ДипломнаяБаза/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ЧасоваяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ДипломнаяБаза/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскаяПлата</name>
  </enumValues>
</mdclass:Enum>

ДипломнаяБаза/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)		
	ПроверкаТипаДоговора();	
КонецПроцедуры

&НаСервере
Процедура ПроверкаТипаДоговора()
	
	ВидДоговора = Объект.ВидДоговора;
	
	Если ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата") Тогда
		Элементы.ВКМ_ДатаНачалаДоговора.Видимость = Ложь;
		Элементы.ВКМ_ДатаОкончанияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_ЧасоваяСтавка.Видимость = Ложь; 
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПроверкаТипаДоговора();
КонецПроцедуры
